# CareerFoundry 4.5 Data Consistency Checks

In [1]:
#Importing necessary libraries
import os
import numpy as np
import pandas as pd

In [4]:
#Creating paths and setting data frame variables
path = r'C:\Users\rmr1q\Instacart Basket Analysis (Aug-2023)'
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

## Working with mixed data types

In [8]:
#Creating a data frame
df_test = pd.DataFrame()

In [9]:
df_test['mix'] = ['a', 'b', 1, True]

In [11]:
df_test

    mix
0     a
1     b
2     1
3  True

In [13]:
#Checking for mixed data
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [17]:
#Forcing the mixed data values to be strings
df_test['mix'] = df_test['mix'].astype('str')

In [18]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [19]:
#Using the .isnull and the .sum functions to view how many missing values are in each column
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [21]:
#Creating a new data frame of all the rows with missing values
df_nan = df_prods[df_prods['product_name'].isnull()==True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [22]:
df_prods.shape

(49693, 5)

In [23]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [24]:
df_prods_clean.shape

(49677, 5)

In [25]:
#Checking for duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [26]:
#Checking the cleaned data shape
#Comparing the shapes of the clean and unclean data indicates how much data was removed
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
df_prods_clean_no_dups.shape

(49672, 5)

# Exercises

## 2. Using the describe function on the orders data frame

In [36]:
#Renaming the Unnamed column to Index
df_ords.rename(columns={'Unnamed: 0' : 'Index'},inplace=True)

In [37]:
df_ords.describe()

,Index,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

All of the describing statistics from the orders data frame appears normal.

# 3. Checking for mixed data

In [39]:
#Using the provided mixed data check code on the orders data frame
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

Nothing was printed from the code above so that means there are no columns with mixed data.

## 5. Checking for missing data

In [40]:
#Using the .isnull function with the .sum function shows how many missing values are in each column
df_ords.isnull().sum()

Index                          0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [43]:
#Creating a new data frame with all of the rows with missing values
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull()==True]
df_ords_nan.head(10)

,Index,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
50,50,2086598,6,prior,1,5,18,NaN
54,54,2565571,7,prior,1,3,9,NaN
75,75,600894,8,prior,1,6,0,NaN
79,79,280530,9,prior,1,1,17,NaN
83,83,1224907,10,prior,1,2,14,NaN

There are over 200k missing values in the days_since_prior_order column

A possible explanation for these missing values is that the values are representing something.

In this case, there is no value for the days since the last order because the customer has not ordered anything before. Looking at the data it can be seen that all of these values occur for a customer's first purchase.

## 6. Address the missing values

The appropriate way that I would handle these missing data values is to leave them as is. The missing values are actually representing something and so removing them does not seem like a good idea.

Changing the values is also problematic. Inputting a value of 0 possibly indicates that the customer already ordered something that same day so the value would have 2 meanings and be confusing. If the value "first_purchase" was entered it would be easy to interpret but then the column would have mixed data and be unsuitable for analysis.

## 7. Checking for duplicates

In [44]:
#Creating a new data frame with all the duplicate rows
df_ords_dups = df_ords[df_ords.duplicated()]
df_ords_dups

Empty DataFrame
Columns: [Index, order_id, user_id, eval_set, order_number, order_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

No duplicates were found in the data frame

## 8. Addressing the duplicates

If any duplicates in the data were found, I would remove one of the rows. It is possible for all of the rows to be indentical except for the order_id. This column serves as a primary key for the data frame which means that all values must be unique.

## 9. Exporting the data

In [46]:
#Saving the cleaned data frames
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_cleaned.csv'))
df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_cleaned.csv'))